Revit 2024 API
PhaseArray.Append Method
Add the phase to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Append(
	Phase item
)
Visual Basic
Public Overridable Sub Append ( _
	item As Phase _
)
Visual C++
public:
virtual void Append(
	Phase^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Phase
The phase to be added.
See Also
PhaseArray Class
Autodesk.Revit.DB Namespace